---
kind: method
id: M:Autodesk.Revit.Exceptions.ArgumentsInconsistentException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
source: html/c66be92c-0e07-6f0f-c20f-e196ed2879b1.htm
---
# Autodesk.Revit.Exceptions.ArgumentsInconsistentException.GetObjectData Method

Retrieves data needed to serialize the target object.

## Syntax (C#)
```csharp
public override void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
```

## Parameters
- **info** (`System.Runtime.Serialization.SerializationInfo`) - Data needed to serialize or deserialize the object.
- **context** (`System.Runtime.Serialization.StreamingContext`) - The destination of the serialized stream.